DSU/src/Documents/ПеремещениеДенежныхСредств/ПеремещениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ОстаткиПланируемыхПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПоСчетам</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиВалют</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетНазначения</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаНазначения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНазначения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяПокупка</name>
    <type>
      <types>CatalogRef.ПланируемыеПокупки</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДействуетДляИсходнойВалюты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКомиссии</name>
    <type>
      <types>DocumentRef.РасходДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВРасходах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВДоходах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзакцияПрихода</name>
    <type>
      <types>DocumentRef.БанковскаяТранзакция</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзакцияРасхода</name>
    <type>
      <types>DocumentRef.БанковскаяТранзакция</types>
    </type>
  </attributes>
</mdclass:Document>

DSU/src/Documents/РасходДенежныхСредств/РасходДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенежныхСредств</name>
  <basedOn>Task.Напоминание</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиПланируемыхПокупок</registerRecords>
  <registerRecords>InformationRegister.СостоянияПланируемыхПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПоСчетам</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиВалют</registerRecords>
  <registerRecords>AccumulationRegister.ДолговыеОбязательства</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должник</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяПокупка</name>
    <type>
      <types>CatalogRef.ПланируемыеПокупки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьВСтруктуреРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскаяТранзакция</name>
    <type>
      <types>DocumentRef.БанковскаяТранзакция</types>
    </type>
  </attributes>
</mdclass:Document>

DSU/src/Documents/ПеремещениеДенежныхСредств/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ДниНедели;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДокументКомиссии) Тогда
		НаличиеКомиссии = Объект.ДокументКомиссии.Проведен;
		ЗаполнитьРеквизитыКомисииИзДокументаРасхода();
	Иначе
		КурсКомиссии = 1;
		КратностьКомиссии = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступностьРеквизитовКомиссии();
	
	ДниНедели = ОбщегоНазначенияКлиент.ПолучитьСоответствиеДнейНедели();
	ОбщегоНазначенияКлиент.ОбновитьНадписьДеньНедели(Элементы.ДеньНедели, ДниНедели, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если (Объект.УчитыватьВДоходах Или Объект.УчитыватьВРасходах) И Не ЗначениеЗаполнено(Объект.СтатьяДДС) Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не заполнена статья движения!");
				
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	 // создадим документ
	Если НаличиеКомиссии Тогда
		
		// получим объект у существующей ссылки или создадим новый объект
		Если Не ЗначениеЗаполнено(ТекущийОбъект.ДокументКомиссии) Тогда
			ДокументКомиссии = Документы.РасходДенежныхСредств.СоздатьДокумент();
			ДокументКомиссии.Дата = ТекущийОбъект.Дата;
			ДокументКомиссии.СтатьяДДС = Справочники.СтатьиДДС.Комиссия;
			ДокументКомиссии.Записать();
			ТекущийОбъект.ДокументКомиссии = ДокументКомиссии.Ссылка;
		Иначе
			ДокументКомиссии = ТекущийОбъект.ДокументКомиссии.ПолучитьОбъект();
		КонецЕсли;	        
		
		// перепишем в него все данные из формы
		ЗаполнитьДокументРасходаИзРеквизитовКомиссии(ДокументКомиссии);
		                   
		// запишем/проведем документ
		ЗаписатьДокументКомиссии(ДокументКомиссии);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаличиеКомиссииПриИзменении(Элемент)
	
	ПриИзменииФлагаНаличиеКомиссии();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументКомиссииПриИзменении(Элемент)
	
	ПриИзмененииДокументаКомиссии();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ОбновитьНадписьДеньНедели(Элементы.ДеньНедели, ДниНедели, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзменииФлагаНаличиеКомиссии()
	
	ОбновитьДоступностьРеквизитовКомиссии();
	
	Если ЗначениеЗаполнено(Объект.ДокументКомиссии) Тогда
		ЗаписатьДокументКомиссии(Объект.ДокументКомиссии.ПолучитьОбъект());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьРеквизитовКомиссии()
	
	Элементы.ДанныеКомиссии.Доступность = НаличиеКомиссии;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокументКомиссии(ДокументКомиссии)
	
	Если ДокументКомиссии.ПометкаУдаления Тогда
		ДокументКомиссии.УстановитьПометкуУдаления(Ложь);
	КонецЕсли;
			
	ДокументКомиссии.Записать(?(НаличиеКомиссии И Объект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.ОтменаПроведения), РежимПроведенияДокумента.Неоперативный);
		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьРеквизитыКомисииИзДокументаРасхода()
	
	КурсКомиссии 	= Объект.ДокументКомиссии.Курс;
	КратностьКомиссии = Объект.ДокументКомиссии.Кратность;
	ВалютаКомиссии 	= Объект.ДокументКомиссии.Валюта;
	СчетКомиссии 	= Объект.ДокументКомиссии.Счет;
	СуммаКомиссии 	= Объект.ДокументКомиссии.Сумма;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументРасходаИзРеквизитовКомиссии(ДокументРасхода)
	
	ДокументРасхода.Курс 		= КурсКомиссии;
	ДокументРасхода.Кратность 	= КратностьКомиссии;
	ДокументРасхода.Валюта 		= ВалютаКомиссии;
	ДокументРасхода.Счет 		= СчетКомиссии;
	ДокументРасхода.Сумма 		= СуммаКомиссии;
	
КонецПроцедуры	

&НаСервере
Процедура ПриИзмененииДокументаКомиссии()
	
	НаличиеКомиссии = ЗначениеЗаполнено(Объект.ДокументКомиссии);   
	ОбновитьДоступностьРеквизитовКомиссии();
	ЗаполнитьРеквизитыКомисииИзДокументаРасхода();
	
КонецПроцедуры

#КонецОбласти
